app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.includes(:softwares).ordered
---
SELECT "softwares".* FROM "softwares" WHERE "softwares"."category_id" IN (1, 2, 3, 4, 5, 6, 7, 8)

  def find_category
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1