app/controllers/admin/dashboard_controller.rb

  def index
    @stats = {
      total_softwares: Software.count,
      published_softwares: Software.published.count,
      total_categories: Category.count,
      total_downloads: Download.count,
      recent_downloads: Download.includes(:software).limit(10).order(created_at: :desc),
      popular_softwares: Software.published.order(downloads_count: :desc).limit(5),
      recent_softwares: Software.order(created_at: :desc).limit(5)
---
SELECT "downloads".* FROM "downloads" ORDER BY "downloads"."created_at" DESC LIMIT 10
SELECT "softwares".* FROM "softwares" WHERE "softwares"."published" = 1 ORDER BY "softwares"."downloads_count" DESC LIMIT 5
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "downloads"