app/controllers/admin/softwares_controller.rb

  def index
    @softwares = Software.includes(:category, featured_image_attachment: :blob)
                        .order(created_at: :desc)
                        .page(params[:page])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 7, 6, 5, 4, 3, 2, 1)
SELECT "softwares".* FROM "softwares" ORDER BY "softwares"."created_at" DESC
SELECT COUNT(*) FROM "softwares"

  def edit
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def update
    if @software.update(software_params)
      redirect_to admin_software_path(@software), notice: 'Software updated successfully'
    else
      @categories = Category.all
---
UPDATE "softwares" SET "official_site" = '', "updated_at" = '2025-08-13 07:14:08.732243' WHERE "softwares"."id" = 16
SELECT "categories".* FROM "categories"

  def find_software
    @software = Software.find(params[:id])
---
SELECT "softwares".* FROM "softwares" WHERE "softwares"."id" = 1 LIMIT 1