app/controllers/admin/softwares_controller.rb

SELECT "softwares".* FROM "softwares" WHERE "softwares"."id" = 1 LIMIT 1
---
  def find_software
    @software = Software.find(params[:id])