app/views/admin/dashboard/index.html.erb

SELECT 1 AS one FROM "downloads" LIMIT 1
---
    <div class="p-6">
      <% if @stats[:recent_downloads].any? %>

SELECT 1 AS one FROM "softwares" LIMIT 1
---
    <div class="p-6">
      <% if @stats[:popular_softwares].any? %>

SELECT 1 AS one FROM "softwares" LIMIT 1
---
    <div class="p-6">
      <% if @stats[:recent_softwares].any? %>