app/views/admin/softwares/_form.html.erb

SELECT "categories".* FROM "categories"
---
              <%= form.label :category_id, "Category", class: "block text-sm font-medium text-gray-300 mb-2" %>
              <%= form.select :category_id,
                  options_from_collection_for_select(@categories, :id, :name, software.category_id),
                  { prompt: "Select a category" },
                  { class: "w-full px-3 py-2 bg-gray-700 border border-gray-600 rounded-md text-white focus:outline-none focus:ring-2 focus:ring-green-500 focus:border-transparent" } %>