app/views/admin/categories/index.html.erb

SELECT "softwares".* FROM "softwares" WHERE "softwares"."category_id" = 1 AND "softwares"."published" = 1 LIMIT 3
---
      <div class="px-6 pb-6">
        <% recent_software = category.softwares.published.limit(3) %>