app/controllers/downloads_controller.rb

UPDATE "softwares" SET "downloads_count" = COALESCE("downloads_count", 0) + 1 WHERE "softwares"."id" = 1
---
  def show
    @software.increment!(:downloads_count)

SELECT "softwares".* FROM "softwares" WHERE "softwares"."published" = 1 AND "softwares"."id" = 1 LIMIT 1
---
  def find_software_and_file
    @software = Software.published.find(params[:software_id])

INSERT INTO "downloads" ("software_id", "ip_address", "user_agent", "file_name", "created_at", "updated_at") VALUES (1, '127.0.0.1', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.5 Safari/605.1.15', 'Photos Library.photoslibrary.zip', '2025-08-13 08:08:24.370774', '2025-08-13 08:08:24.370774') RETURNING "id"
---
  def log_download
    Download.create!(
      software: @software,
      ip_address: request.remote_ip,
      user_agent: request.user_agent,
      file_name: @attachment.filename.to_s
    )