app/controllers/softwares_controller.rb

  def index
    @softwares = Software.published.includes(:category, featured_image_attachment: :blob)

    if params[:category_id].present?
      @current_category = Category.find(params[:category_id])
      @softwares = @softwares.where(category: @current_category)
    end

    @softwares = @softwares.recent.limit(20)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 7, 6, 5, 4, 3, 2, 1)
SELECT "softwares".* FROM "softwares" WHERE "softwares"."category_id" IN (1, 2, 3, 4, 5, 6, 7, 8)
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 LIMIT 1
SELECT "softwares".* FROM "softwares" WHERE "softwares"."published" = 1 AND "softwares"."category_id" = 3 ORDER BY "softwares"."created_at" DESC LIMIT 20

  def show
    @software = Software.published.find(params[:id])
    @related_softwares = Software.published
                                .where(category: @software.category)
                                .where.not(id: @software.id)
                                .limit(4)
---
SELECT "softwares".* FROM "softwares" WHERE "softwares"."published" = 1 AND "softwares"."id" = 17 LIMIT 1
SELECT "softwares".* FROM "softwares" WHERE "softwares"."published" = 1 AND "softwares"."category_id" = 7 AND "softwares"."id" != 14 LIMIT 4